package monopoly_1;

// 땅정보를 담고있는 클래스로 landPanel을 초기화하는 용도 등으로 객체생성없이 사용됨
public class LandConstants {
	static public final String[] NAME = {"세종대정문", "세종관", "다산관", "찬", "미니게임",
			"군자관", "영실관", "이당관", "과제폭탄", "용덕관",
			"모짜르트홀", "시계탑", "카드", "집현관", "진관홀",
			"애지헌", "축제", "기숙사", "박물관", "학생회관",
			"미니게임(오른)", "카페드림", "우정당", "학술정보원", "자유시간",
			"헨젤과그레텔", "율곡관", "충무관", "카드", "대양홀",
			"광개토관", "소프트웨어융합대학"};
	
	static public final int[] LAND_PRICE = {
			0,20000, 26000, 100000, 0, 45000, 48000, 54000,
			0, 72000, 72000, 100000, 0, 94000, 94000, 100000, 
			0, 110000, 120000, 130000, 0, 100000, 140000, 10000,
			0, 100000, 160000, 170000, 0, 190000, 190000, 200000};
	
	static public final int[] BUILD_PRICE = {
			50000, 50000, 0, 0, 100000, 100000, 100000,
			0, 150000, 150000, 0, 0, 200000, 200000, 200000,
			0, 250000, 250000, 250000, 0, 0, 300000, 300000, 
			0, 0, 350000, 350000, 0, 400000, 400000, 400000	};
}
